Revit 2027 API
ACADExportOptions.LinetypesFileName Property
 The custom linetype file name (*.lin). Default value is empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string LinetypesFileName { get; set; }
Public Property LinetypesFileName As String
	Get
	Set
public:
property String^ LinetypesFileName {
	String^ get ();
	void set (String^ value);
}
member LinetypesFileName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ACADExportOptions Class
Autodesk.Revit.DB Namespace